---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationTopElevationOfPart
source: html/8a42c42b-b143-2c32-5a68-9ff47d552be9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationTopElevationOfPart Property

"Top Elevation"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationTopElevationOfPart { get; }
```